[
  {
    "id": "volcano",
    "title": "ภูเขาไฟจำลอง",
    "category": "Chemistry",
    "difficulty": "Easy",
    "time": "30 นาที",
    "materials": ["เบคกิ้งโซดา","น้ำส้มสายชู","สีผสมอาหาร","โคลส"],
    "steps": ["เตรียมฐาน","ผสมส่วนผสม","จุดปฏิกิริยา และสังเกต"],
    "purpose": "สอนการเกิดปฏิกิริยาเคมีระหว่างกรด-เบส",
    "description": "สร้างภูเขาไฟจำลองที่ปะทุด้วยเบคกิ้งโซดาและน้ำส้มสายชู เหมาะสำหรับเด็กที่อยากเรียนรู้เคมีในชีวิตประจำวัน การทดลองนี้จะแสดงให้เห็นปฏิกิริยาระหว่างกรดและเบส ซึ่งปล่อยก๊าซคาร์บอนไดออกไซด์ทำให้เกิดฟองและล้นออกมาเหมือนลาวาจากภูเขาไฟ",
    "sciencePrinciple": "เมื่อกรด (น้ำส้มสายชู) ทำปฏิกิริยากับเบส (เบคกิ้งโซดา) จะเกิดปฏิกิริยาเคมีที่ปล่อยก๊าซคาร์บอนไดออกไซด์ (CO₂) ทำให้เกิดฟองและฟู ปฏิกิริยานี้คือ: NaHCO₃ + CH₃COOH → CO₂ + H₂O + CH₃COONa",
    "funFacts": ["ภูเขาไฟจริงปะทุจากหินหนืดหลอมละลายที่เรียกว่าแมกมา ไม่ใช่จากปฏิกิริยาเคมี", "สีผสมอาหารทำให้ดูสมจริงขึ้น โดยสีแดงหรือส้มจะคล้ายลาวา"],
    "warnings": "ไม่รับประทานวัสดุ หลีกเลี่ยงตา",
    "image": "/assets/images/volcano.svg"
  },
  {
    "id": "lava-lamp",
    "title": "เครื่องลาวาโฮมเมด",
    "category": "Physics",
    "difficulty": "Medium",
    "time": "45 นาที",
    "materials": ["น้ำ","น้ำมัน","เกลือ","น้ำยาล้างจาน","สีผสมอาหาร"],
    "steps": ["เติมน้ำและน้ำมัน","เพิ่มสี","สร้างฟองด้วยเกลือ"],
    "purpose": "สอนหลักการความหนาแน่นและการไม่ละลายกันของของเหลว",
    "description": "สร้างโคมลาวาสุดเจ๋งด้วยวัสดุในครัว! ดูฟองสีสันสวยงามลอยขึ้นลงในขวด การทดลองนี้สาธิตความแตกต่างของความหนาแน่นระหว่างน้ำและน้ำมัน และแสดงให้เห็นว่าของเหลวบางชนิดไม่สามารถละลายรวมกันได้",
    "sciencePrinciple": "น้ำมีความหนาแน่นมากกว่าน้ำมัน ทำให้น้ำจมลงข้างล่าง เมื่อใส่เกลือ มันจะดึงน้ำที่มีสีลงไปด้านล่าง และเมื่อเกลือละลาย น้ำก็จะลอยกลับขึ้นมาใหม่ เกิดเป็นการเคลื่อนไหวสวยงามแบบลาวาโคม",
    "funFacts": ["โคมลาวาจริงถูกประดิษฐ์ในปี 1963 โดยนักบัญชีชาวอังกฤษ", "ถ้าใช้ไฟฉายส่องจากด้านล่าง จะทำให้ดูสวยงามยิ่งขึ้น"],
    "warnings": "เก็บให้พ้นมือเด็กเล็ก",
    "image": "/assets/images/lava-lamp.svg"
  },
  {
    "id": "bridge",
    "title": "สะพานจากไม้ไอติม",
    "category": "Engineering",
    "difficulty": "Hard",
    "time": "120 นาที",
    "materials": ["ไม้ไอติม","กาว","เชือก"],
    "steps": ["ออกแบบ","ก่อสร้าง","ทดสอบน้ำหนัก"],
    "purpose": "สอนการออกแบบโครงสร้างและแรง",
    "description": "ท้าทายทักษะวิศวกรรมของคุณด้วยการสร้างสะพานจากไม้ไอติม! ออกแบบโครงสร้างที่แข็งแรงที่สุดและทดสอบว่ารับน้ำหนักได้เท่าไร โครงการนี้จะสอนหลักการแรง โมเมนต์ และการกระจายน้ำหนักในโครงสร้างวิศวกรรม",
    "sciencePrinciple": "สะพานต้องรับแรงกด แรงดึง และแรงบิด รูปแบบสามเหลี่ยมช่วยกระจายน้ำหนักและเพิ่มความแข็งแรง สะพานแบบ Truss ใช้หลักการนี้ในการก่อสร้างสะพานจริง",
    "funFacts": ["สะพานโกลเด้นเกตในซานฟรานซิสโกใช้เหล็กกว่า 80,000 ไมล์ในการสร้าง", "สะพานไม้ไอติมบางอันสามารถรับน้ำหนักได้มากกว่า 100 กก."],
    "warnings": "ใช้กาวด้วยความระมัดระวัง",
    "image": "/assets/images/bridge.svg"
  },
  {
    "id": "solar-still",
    "title": "เครื่องกลั่นน้ำพลังงานแสงอาทิตย์ (Solar Still)",
    "category": "Energy",
    "difficulty": "Easy",
    "time": "2-4 ชั่วโมง",
    "materials": ["ชามหรือกะละมังสีเข้ม","แก้วน้ำ","พลาสติกใส (พลาสติกแรป)","ก้อนหินเล็กๆ","น้ำที่ไม่สะอาด"],
    "steps": [
      "วางแก้วเปล่าไว้ตรงกลางกะละมัง",
      "เทน้ำที่ไม่สะอาดลงในกะละมังโดยไม่ให้ระดับน้ำล้นเข้าแก้ว",
      "คลุมปากกะละมังด้วยพลาสติกใสให้ตึง",
      "วางก้อนหินไว้ตรงกลางพลาสติกเหนือแก้วเพื่อทำให้พลาสติกเป็นแอ่ง",
      "นำไปวางกลางแดดจัดและรอให้ไอน้ำควบแน่นเป็นหยดลงในแก้ว"
    ],
    "purpose": "เปลี่ยนน้ำที่ไม่สะอาดให้กลายเป็นน้ำบริสุทธิ์โดยใช้พลังงานแสงอาทิตย์",
    "description": "เรียนรู้วิธีทำน้ำบริสุทธิ์จากน้ำทะเลหรือน้ำสกปรกโดยใช้เพียงพลังงานแสงอาทิตย์! เทคนิคนี้ใช้ในการเอาตัวรอดในสภาพฉุกเฉินและเป็นวิธีที่ยั่งยืนในการผลิตน้ำสะอาด เหมาะสำหรับการเรียนรู้เรื่องวัฏจักรน้ำและพลังงานทางเลือก",
    "sciencePrinciple": "แสงอาทิตย์ให้ความร้อนทำให้น้ำระเหยเป็นไอ ไอน้ำลอยขึ้นไปกระทบพลาสติกที่เย็นกว่า จึงควบแน่นกลับเป็นหยดน้ำสะอาด สารละลายและสิ่งสกปรกไม่ระเหย ทำให้น้ำที่ได้บริสุทธิ์",
    "funFacts": ["เทคนิคนี้ใช้ได้จริงในการเอาตัวรอดในทะเลทราย", "ในหนึ่งวัน Solar Still ขนาดกลางสามารถผลิตน้ำได้ 1-3 ลิตร"],
    "warnings": "อย่าใช้วัสดุเป็นพิษหรือเก็บน้ำที่ได้โดยไม่ต้มหากไม่แน่ใจในความบริสุทธิ์",
    "image": "/assets/images/solar-still.svg"
  },
  {
    "id": "microbial-fuel-cell",
    "title": "แบตเตอรี่ชีวภาพจากดิน (Microbial Fuel Cell)",
    "category": "Biology",
    "difficulty": "Medium",
    "time": "5-7 วัน (เพื่อให้จุลินทรีย์ทำงาน)",
    "materials": ["ขวดโหล 2 ใบ","ดินโคลนจากแหล่งน้ำนิ่ง","แผ่นทองแดง","แผ่นสังกะสี","สายไฟและคลิปปากจระเข้","หลอด LED/มัลติมิเตอร์"],
    "steps": [
      "เจาะฝาขวดสำหรับสอดสายไฟ",
      "ต่อสายไฟเข้ากับแผ่นโลหะแต่ละแผ่น",
      "ใส่ดินโคลนลงในขวด เติมน้ำเล็กน้อยให้ชุ่ม",
      "ฝังแผ่นทองแดงและแผ่นสังกะสีลงในดินให้ห่างกัน",
      "ปิดขวดและเก็บไว้ในที่อุ่นประมาณ 5-7 วัน จากนั้นวัดแรงดันหรือลองต่อ LED"
    ],
    "purpose": "สาธิตการผลิตกระแสไฟฟ้าจากกิจกรรมของจุลินทรีย์ในสิ่งแวดล้อม",
    "description": "สร้างแบตเตอรี่ธรรมชาติที่ใช้จุลินทรีย์ในดินผลิตไฟฟ้า! โครงการนี้แสดงให้เห็นว่าสิ่งมีชีวิตเล็กๆ สามารถสร้างพลังงานได้ ใช้เวลาอดทนรอสักหน่อย แต่เมื่อเห็นหลอด LED ติดได้ คุณจะรู้สึกประทับใจมาก",
    "sciencePrinciple": "จุลินทรีย์ในดินย่อยสลายอินทรีย์วัตถุและปล่อยอิเล็กตรอน อิเล็กตรอนเหล่านี้ถูกจับโดยขั้วโลหะ (anode) และไหลผ่านวงจรไปยังขั้วอีกด้าน (cathode) ทำให้เกิดกระแสไฟฟ้า",
    "funFacts": ["เทคโนโลยี MFC อาจใช้ผลิตไฟฟ้าจากน้ำเสียในอนาคต", "บางแห่งทดลองใช้ MFC ขนาดใหญ่เพื่อผลิตไฟฟ้าจากตะกอนที่ก้นทะเล"],
    "warnings": "ดินอาจมีเชื้อโรค หลีกเลี่ยงการสัมผัสโดยตรงและล้างมือหลังทำ",
    "image": "/assets/images/microbial-fuel-cell.svg"
  },
  {
    "id": "seismograph",
    "title": "เครื่องวัดแผ่นดินไหวอย่างง่าย (Seismograph)",
    "category": "Geology",
    "difficulty": "Medium",
    "time": "30-60 นาที (ไม่รวมการตั้งค่าทดสอบ)",
    "materials": ["กล่องกระดาษแข็ง","ตุ้มน้ำหนัก (น็อตหรือหิน)","เชือก","ปากกาเมจิก","กระดาษม้วน"],
    "steps": [
      "ตัดกล่องเพื่อทำโครงเครื่องเปิด",
      "แขวนตุ้มน้ำหนักด้วยเชือกกับด้านบนของโครง",
      "ติดปากกากับตุ้มน้ำหนักให้ปลายปากกาชี้ลง",
      "วางกระดาษไว้ใต้ปากกาและดึงให้เคลื่อนที่ช้าๆ",
      "บันทึกการเขย่าและวิเคราะห์รูปแบบเส้นที่ได้"
    ],
    "purpose": "บันทึกรูปแบบการสั่นสะเทือนของพื้นดินโดยใช้หลักความเฉื่อย",
    "warnings": "ติดตั้งให้มั่นคงและไม่ใช้แรงเกินที่อุปกรณ์รับได้",
    "image": "/assets/images/seismograph.svg"
  },
  {
    "id": "casein-plastic",
    "title": "สร้างพลาสติกชีวภาพจากนม (Casein Plastic)",
    "category": "Chemistry",
    "difficulty": "Easy",
    "time": "1-3 วัน (รวมการตกแต่งและการแห้ง)",
    "materials": ["นม","น้ำส้มสายชู","หม้อ","ตะแกรงกรอง","แม่พิมพ์"],
    "steps": [
      "อุ่นนมจนเกือบร้อนแต่ไม่เดือด",
      "เติมน้ำส้มสายชูทีละช้อนและคนช้าๆ จนเกิดลิ่ม",
      "ยกลงและกรองเอาส่วนลิ่ม",
      "บีบน้ำออกแล้วนวดหรืออัดลงพิมพ์",
      "ทิ้งให้แห้ง 2-3 วันจนแข็งตัว"
    ],
    "purpose": "แปลงโปรตีนเคซีนในนมให้เป็นวัสดุแข็งที่คล้ายพลาสติก",
    "warnings": "ระวังอุณหภูมิและไม่รับประทานผลิตภัณฑ์ที่ได้",
    "image": "/assets/images/casein-plastic.svg"
  },
  {
    "id": "zeer-pot",
    "title": "ตู้เย็นไม่ใช้ไฟฟ้า (Zeer Pot)",
    "category": "Physics",
    "difficulty": "Easy",
    "time": "30-60 นาที (เตรียม) + การใช้งานต่อเนื่อง",
    "materials": ["หม้อดินเผาสองใบ","ทราย","น้ำ","ผ้าชุบน้ำ"],
    "steps": [
      "วางหม้อใบเล็กไว้ในหม้อใบใหญ่",
      "เติมทรายในช่องว่างแล้วรดน้ำจนชุ่ม",
      "ใส่ผักผลไม้ในหม้อใบเล็กและคลุมด้วยผ้าชุบน้ำ",
      "วางไว้ในที่มีลมไหลผ่านเพื่อให้การระเหยทำงาน" 
    ],
    "purpose": "ยืดอายุผักผลไม้และเก็บรักษาอาหารโดยใช้งานการระเหย",
    "warnings": "เติมน้ำในทรายเป็นประจำและหลีกเลี่ยงวางในที่ชื้นเกินไป",
    "image": "/assets/images/zeer-pot.svg"
  },
  {
    "id": "water-rocket",
    "title": "จรวดขวดน้ำ (Water Rocket)",
    "category": "Physics",
    "difficulty": "Medium",
    "time": "30-60 นาที",
    "materials": ["ขวด PET","น้ำ","จุก/ที่อุด","ที่สูบลมจักรยาน","วัสดุทำปีก (กระดาษแข็ง)","ฐานปล่อย"],
    "steps": [
      "เตรียมขวดและติดปีกเพื่อความเสถียร",
      "เติมน้ำประมาณ 1/3 ของขวด",
      "อุดปากขวดและต่อที่สูบลม เติมแรงดันจนพร้อมปล่อย",
      "วางบนฐานปล่อยในที่โล่งแล้วปล่อยเมื่อแรงดันเพียงพอ"
    ],
    "purpose": "สาธิตหลักการแรงปฏิกิริยา (Action-Reaction) ของนิวตัน",
    "warnings": "ทำในที่โล่ง ห้ามเอาใกล้ใบหน้าหรือเด็กเล็กโดยไม่มีผู้ใหญ่ดูแล",
    "image": "/assets/images/water-rocket.svg"
  },
  {
    "id": "herb-bug-spray",
    "title": "สเปรย์ไล่แมลงสมุนไพร (Herb Bug Spray)",
    "category": "Chemistry",
    "difficulty": "Easy",
    "time": "2-4 วัน (แช่สมุนไพร)",
    "materials": ["สมุนไพรกลิ่นฉุน (ตะไคร้, สะเดา, กะเพรา)","น้ำร้อน","แอลกอฮอล์ (แอลกอฮอล์ล้างแผลหรือวอดก้า)","ขวดสเปรย์"],
    "steps": [
      "สับสมุนไพรให้ละเอียดและใส่ในขวดโหล",
      "เติมน้ำร้อนแล้วทิ้งให้เย็น จากนั้นเติมแอลกอฮอล์ในอัตราส่วน 1:1",
      "ปิดขวดและเก็บในที่มืด 2-3 วัน เขย่าทุกวัน",
      "กรองและบรรจุลงขวดสเปรย์พร้อมใช้งาน"
    ],
    "purpose": "ทำสเปรย์ไล่แมลงจากน้ำมันหอมระเหยของพืชที่ปลอดภัยต่อร่างกาย",
    "warnings": "ทดสอบบนผิวหนังจุดเล็กๆ ก่อนใช้และเก็บให้พ้นมือเด็ก",
    "image": "/assets/images/herb-bug-spray.svg"
  },
  {
    "id": "backyard-foundry",
    "title": "โรงหล่อโลหะฉบับหลังบ้าน (The Backyard Foundry)",
    "category": "Engineering",
    "difficulty": "Hard",
    "time": "4-6 ชั่วโมง",
    "materials": ["ถังเหล็ก","ปูนทนไฟ","ท่อเหล็ก","ไดร์เป่าผม","เบ้าหลอมแกรไฟต์","ถ่าน","ทรายสำหรับทำแม่พิมพ์","เศษกระป๋องอะลูมิเนียม","ถุงมือหนังทนความร้อนสูง","แว่นตากันสะเก็ด","หน้ากากป้องกันใบหน้า"],
    "steps": [
      "สร้างเตาหลอมด้วยการผสมปูนทนไฟฉาบด้านในถังเหล็กให้เป็นโพรง โดยมีรูสำหรับเป่าลมเข้าด้านล่าง",
      "ทำแม่พิมพ์โดยนำวัตถุต้นแบบมากดลงในทรายที่ผสมตัวประสาน แล้วยกต้นแบบออกอย่างระมัดระวัง",
      "จุดถ่านในเตาแล้วใช้ไดร์เป่าผมเป่าลมเข้าไปเร่งไฟจนร้อนจัด ใส่เบ้าหลอมที่มีเศษอะลูมิเนียมลงไป",
      "ใช้คีมเหล็กยาวจับเบ้าหลอมแล้วเทโลหะเหลวลงในแม่พิมพ์ทรายที่เตรียมไว้",
      "ทิ้งไว้จนโลหะเย็นและแข็งตัวสนิท แล้วจึงทุบแม่พิมพ์ทรายออก"
    ],
    "purpose": "เปลี่ยนเศษกระป๋องอะลูมิเนียมให้กลายเป็นของชิ้นใหม่ที่มีรูปทรงตามต้องการ",
    "description": "สร้างโรงหล่อโลหะในหลังบ้านเพื่อรีไซเคิลเศษโลหะให้กลายเป็นชิ้นส่วนเครื่องมือ ที่ทับกระดาษ หรือวัตถุศิลปะที่มีชิ้นเดียวในโลก เป็นการสัมผัสศาสตร์การถลุงโลหะยุคโบราณด้วยเทคโนโลยียุคใหม่",
    "sciencePrinciple": "จุดหลอมเหลว (Melting Point): การให้พลังงานความร้อนสูงเกิน 660°C ซึ่งเป็นจุดหลอมเหลวของอะลูมิเนียม เพื่อเปลี่ยนสถานะจากของแข็งเป็นของเหลว การเผาไหม้สมบูรณ์ (Combustion): การออกแบบเตาหลอมให้มีอากาศไหลเวียนเพียงพอเพื่อเร่งอุณหภูมิของถ่านให้ร้อนจัด การหล่อโลหะ (Casting): การเทโลหะเหลวลงในแม่พิมพ์ทรายที่เตรียมไว้ ซึ่งจะคงรูปไว้เมื่อโลหะเย็นตัวลงและกลับเป็นของแข็งอีกครั้ง",
    "funFacts": ["โรงหล่อโลหะถูกใช้มาตั้งแต่ยุคสำริดเมื่อ 5,000 ปีก่อน","อะลูมิเนียมสามารถรีไซเคิลได้ไม่จำกัดครั้งโดยไม่สูญเสียคุณภาพ"],
    "warnings": "ต้องสวมอุปกรณ์ความปลอดภัยครบถ้วน ทำในพื้นที่โล่งและห่างจากวัตถุไวไฟ ระวังการกระเด็นของโลหะเหลว ไม่เทน้ำลงในโลหะเหลวเด็ดขาด",
    "image": "/assets/images/backyard-foundry.svg"
  },
  {
    "id": "stirling-engine",
    "title": "เครื่องยนต์สเตอร์ลิง (The Stirling Engine)",
    "category": "Physics",
    "difficulty": "Hard",
    "time": "6-8 ชั่วโมง",
    "materials": ["กระป๋องน้ำอัดลม 2 ใบ","ลูกโป่ง","ลวด","ตลับลูกปืนเล็กๆ","ฝอยเหล็กขัดหม้อ (Steel Wool)","กาวอีพ็อกซี่","เทียนหรือแก้วน้ำร้อน"],
    "steps": [
      "สร้างชุดลูกสูบหลักและลูกสูบย้ายอากาศ (Displacer Piston) จากกระป๋องและฝอยเหล็ก",
      "ประกอบชิ้นส่วนทั้งหมดเข้าด้วยกันอย่างระมัดระวังให้ระบบปิดสนิท ไม่มีอากาศรั่ว",
      "สร้างชุดข้อเหวี่ยง (Crankshaft) จากลวด เพื่อแปลงการเคลื่อนที่แนวตั้งของลูกสูบเป็นการหมุน",
      "ปรับจังหวะการทำงานของลูกสูบทั้งสองให้ถูกต้อง",
      "นำเครื่องยนต์ไปวางบนแก้วน้ำร้อน หรือใช้เปลวเทียนให้ความร้อนที่ก้นกระป๋อง"
    ],
    "purpose": "สร้างเครื่องยนต์ที่ทำงานได้จากความร้อนทุกชนิด (น้ำร้อน แสงแดด เปลวเทียน) โดยไม่มีการเผาไหม้ภายใน",
    "description": "เครื่องยนต์ที่ดูเหมือนมีเวทมนตร์ สามารถทำงานได้เองอย่างเงียบๆ ตราบใดที่ยังมีความร้อนป้อนให้ เป็นภาพที่น่าตื่นตาและแสดงให้เห็นถึงอัจฉริยภาพทางฟิสิกส์อย่างเป็นรูปธรรม",
    "sciencePrinciple": "เป็นเครื่องยนต์วงจรปิดที่ทำงานโดยอาศัยหลักการที่ว่า อากาศจะขยายตัวเมื่อได้รับความร้อน และจะหดตัวเมื่อเย็นลง การออกแบบให้มีลูกสูบ 2 ตัวทำงานสลับกัน โดยลูกสูบหนึ่งจะย้ายอากาศไปมาระหว่างด้านร้อนและด้านเย็น ทำให้เกิดการขยายและหดตัวของอากาศสลับไปมาอย่างต่อเนื่อง ดันให้ลูกสูบอีกตัว (Power Piston) เคลื่อนที่และสร้างเป็นพลังงานกล",
    "funFacts": ["เครื่องยนต์สเตอร์ลิงถูกประดิษฐ์ในปี 1816 โดย Robert Stirling","NASA ใช้เครื่องยนต์สเตอร์ลิงในยานอวกาศบางภารกิจ"],
    "warnings": "ระวังความร้อนจากแหล่งพลังงาน ตรวจสอบให้แน่ใจว่าชิ้นส่วนหมุนไม่กระแทกหรือหลุด",
    "image": "/assets/images/stirling-engine.svg"
  },
  {
    "id": "automated-greenhouse",
    "title": "ระบบปลูกผักอัตโนมัติ (Automated Mini-Greenhouse)",
    "category": "Engineering",
    "difficulty": "Medium",
    "time": "4-6 ชั่วโมง",
    "materials": ["บอร์ด Arduino","เซ็นเซอร์วัดความชื้นในดิน","เซ็นเซอร์วัดแสง (LDR)","ปั๊มน้ำขนาดเล็ก","รีเลย์","หลอดไฟ LED Grow Light","สายไฟ","กล่องพลาสติกใส","ท่อยาง","แหล่งจ่ายไฟ"],
    "steps": [
      "ประกอบโครงสร้างโรงเรือนขนาดเล็ก",
      "ติดตั้งเซ็นเซอร์วัดความชื้นลงในดิน และเซ็นเซอร์วัดแสงในตำแหน่งที่เหมาะสม",
      "ต่อวงจรอิเล็กทรอนิกส์ โดยให้ Arduino เป็นศูนย์กลางเชื่อมต่อระหว่างเซ็นเซอร์กับปั๊มน้ำและหลอดไฟ",
      "เขียนโค้ดโปรแกรมเงื่อนไข เช่น ถ้าค่าความชื้นในดินต่ำกว่า 40% ให้สั่งเปิดปั๊มน้ำเป็นเวลา 5 วินาที",
      "ทดสอบและปรับค่าต่างๆ ให้เหมาะสมกับพืชที่ปลูก"
    ],
    "purpose": "สร้างระบบที่สามารถดูแลต้นไม้แทนเรา (รดน้ำเมื่อดินแห้ง ให้แสงเมื่อมืด) ได้อย่างอัตโนมัติ",
    "description": "ระบบนิเวศขนาดเล็กที่ดูแลตัวเองได้ เป็นการผสมผสานระหว่างธรรมชาติและเทคโนโลยีอย่างลงตัว และเป็นพื้นฐานสำคัญสู่ความเข้าใจในเรื่อง Internet of Things (IoT) และ Smart Farming",
    "sciencePrinciple": "การสร้างระบบอัตโนมัติ (Automation System) โดยใช้ไมโครคอนโทรลเลอร์ (เช่น Arduino) เป็นสมอง อ่านค่าจากเซ็นเซอร์ (Sensors) แล้วสั่งการให้อุปกรณ์แอคชูเอเตอร์ (Actuators) ทำงานตามเงื่อนไขที่ตั้งโปรแกรมไว้",
    "funFacts": ["เทคโนโลยี Smart Farming สามารถเพิ่มผลผลิตได้ถึง 30%","ระบบอัตโนมัติช่วยประหยัดน้ำได้มากกว่า 50% เมื่อเทียบกับการรดน้ำด้วยมือ"],
    "warnings": "ระวังไฟฟ้าลัดวงจร ตรวจสอบการต่อสายไฟให้ถูกต้อง ไม่ให้น้ำเข้าสัมผัสวงจรอิเล็กทรอนิกส์",
    "image": "/assets/images/automated-greenhouse.svg"
  },
  {
    "id": "newtonian-telescope",
    "title": "กล้องโทรทรรศน์แบบนิวตัน (The Newtonian Telescope)",
    "category": "Physics",
    "difficulty": "Hard",
    "time": "8-12 ชั่วโมง",
    "materials": ["กระจกเงาเว้า (Concave Mirror)","กระจกเงาราบขนาดเล็ก","เลนส์ใกล้ตา (Eyepiece)","ท่อ PVC ขนาดใหญ่","ไม้สำหรับสร้างฐานตั้ง","สกรูและอุปกรณ์ยึด","กระดาษทรายละเอียด","สีพ่นดำด้าน"],
    "steps": [
      "คำนวณหาระยะโฟกัสของกระจกเงาหลัก",
      "ติดตั้งกระจกเงาหลักไว้ที่ท้ายของท่อ PVC",
      "ติดตั้งกระจกเงารองในตำแหน่งที่ถูกต้องเพื่อเบี่ยงแสงออกมาด้านข้าง",
      "เจาะรูด้านข้างท่อแล้วติดตั้งชุดเลนส์ใกล้ตา (Focuser)",
      "สร้างฐานตั้งกล้องแบบ Dobsonian ซึ่งทำให้ขยับกล้องเพื่อหาดาวได้ง่าย"
    ],
    "purpose": "สร้างอุปกรณ์ที่สามารถมองเห็นดวงจันทร์และดาวเคราะห์ดวงอื่นในระบบสุริยะได้อย่างชัดเจน",
    "description": "กล้องโทรทรรศน์ที่ทรงพลังพอที่จะมองเห็นหลุมบนดวงจันทร์ วงแหวนของดาวเสาร์ หรือดาวพฤหัสบดีกับดวงจันทร์บริวารทั้งสี่ดวง เป็นประสบการณ์ที่เปลี่ยนมุมมองต่อจักรวาลไปตลอดกาล",
    "sciencePrinciple": "การใช้กระจกเงาเว้า (Concave Mirror) ซึ่งเป็นหัวใจของกล้องแบบนิวตัน ทำหน้าที่รวบรวมแสงจากวัตถุไกลๆ แล้วสะท้อนไปรวมกันที่จุดโฟกัส จากนั้นใช้กระจกเงาราบ (Flat Secondary Mirror) ทำมุม 45 องศา เพื่อหักเหแสงออกมาด้านข้างของลำกล้อง แล้วใช้เลนส์ใกล้ตา (Eyepiece) ขยายภาพจากจุดโฟกัสนั้นให้เรามองเห็นได้",
    "funFacts": ["Isaac Newton ประดิษฐ์กล้องแบบนี้ในปี 1668","กล้องโทรทรรศน์ Hubble ใช้หลักการคล้ายกัน แต่ใหญ่กว่ามากและอยู่ในอวกาศ"],
    "warnings": "ห้ามมองดวงอาทิตย์โดยตรงผ่านกล้อง อาจทำให้ตาบอดถาวร ใช้เฉพาะมองดาวเคราะห์และดวงจันทร์เท่านั้น",
    "image": "/assets/images/newtonian-telescope.svg"
  },
  {
    "id": "sundial",
    "title": "นาฬิกาแดดโบราณ (Sundial)",
    "category": "Physics",
    "difficulty": "Easy",
    "time": "1 วัน (ทำเครื่องหมายทุกชั่วโมง)",
    "materials": ["แท่งไม้ตรงหรือดินสอ","ดินน้ำมันหรือฐานสำหรับปัก","แผ่นกระดาษแข็งหรือจานกระดาษ","ก้อนหินหรือสีสำหรับทำเครื่องหมาย"],
    "steps": [
      "นำแท่งไม้มาปักไว้ตรงกลางแผ่นกระดาษแข็งโดยใช้ดินน้ำมันยึดให้ตั้งฉาก 90 องศา",
      "นำไปวางในที่โล่งแดดจัด",
      "เมื่อถึงเวลา 8:00 น. ให้ลากเส้นตามเงาที่ทอดลงบนกระดาษแล้วเขียนเลข 8",
      "ทำซ้ำทุกๆ ชั่วโมง (9:00, 10:00...) จนถึงช่วงเย็น",
      "ในวันถัดไป นาฬิกาแดดนี้จะสามารถบอกเวลาโดยประมาณได้ เมื่อเงาเคลื่อนไปทับเส้นที่ขีดไว้"
    ],
    "purpose": "สร้างอุปกรณ์บอกเวลาที่เก่าแก่ที่สุดในโลก โดยใช้แค่เงาของดวงอาทิตย์",
    "description": "นาฬิกาแดดที่ใช้งานได้จริง เป็นการเชื่อมโยงตัวเองเข้ากับการเคลื่อนที่ของโลกและดวงดาว การสร้างนาฬิกาแดดทำให้เข้าใจถึงหลักการหมุนรอบตัวเองของโลกและการเคลื่อนที่ของดวงอาทิตย์",
    "sciencePrinciple": "การหมุนรอบตัวเองของโลก ทำให้ตำแหน่งปรากฏของดวงอาทิตย์บนท้องฟ้าเปลี่ยนแปลงไปอย่างสม่ำเสมอ ส่งผลให้เงาของวัตถุที่หยุดนิ่ง (เรียกว่า Gnomon) เคลื่อนที่เป็นมุมคงที่ตลอดทั้งวัน เราสามารถใช้การเคลื่อนที่ของเงานี้เพื่อแบ่งช่วงเวลาของวันได้",
    "funFacts": ["นาฬิกาแดดถูกใช้มากว่า 3,500 ปีในอียิปต์โบราณ","นาฬิกาแดดใหญ่ที่สุดในโลกอยู่ที่อินเดีย สูงกว่า 27 เมตร"],
    "warnings": "อาจไม่แม่นยำในวันที่มีเมฆมาก ต้องปรับตามฤดูกาลและตำแหน่งของดวงอาทิตย์",
    "image": "/assets/images/sundial.svg"
  },
  {
    "id": "periscope",
    "title": "กล้องเรือดำน้ำ (Periscope)",
    "category": "Physics",
    "difficulty": "Easy",
    "time": "30-45 นาที",
    "materials": ["กล่องนมหรือกล่องกระดาษทรงยาว","กระจกเงาเล็กๆ 2 บาน","เทปกาว","คัตเตอร์"],
    "steps": [
      "เจาะช่องสี่เหลี่ยมสำหรับมองที่ด้านหน้าส่วนล่างของกล่อง",
      "เจาะช่องสี่เหลี่ยมขนาดเดียวกันที่ด้านหลังส่วนบนของกล่อง",
      "กรีดช่องสำหรับเสียบกระจกที่ด้านข้างของกล่อง ให้ทำมุม 45 องศา โดยช่องแรกอยู่ด้านล่างใกล้ช่องมอง และช่องที่สองอยู่ด้านบนใกล้ช่องรับแสง",
      "สอดกระจกเข้าไปในช่องและยึดด้วยเทปกาว ตรวจสอบให้แน่ใจว่ากระจกขนานกัน"
    ],
    "purpose": "สร้างอุปกรณ์ที่ทำให้เรามองเห็นข้ามกำแพงหรือสิ่งกีดขวางได้",
    "description": "กล้องเปอริสโคปที่สามารถใช้ส่องดูข้ามสิ่งกีดขวางได้จริง เป็นหลักการเดียวกับที่ใช้ในเรือดำน้ำเพื่อมองเห็นผิวน้ำขณะอยู่ใต้น้ำ",
    "sciencePrinciple": "กฎการสะท้อนของแสง (Law of Reflection) - แสงเดินทางเป็นเส้นตรง เมื่อแสงกระทบกระจกเงาที่ทำมุม 45 องศา มันจะสะท้อนออกไปทำมุม 45 องศาเช่นกัน (รวมเป็น 90 องศา) เราใช้กระจกสองบานเพื่อหักเส้นทางการมองเห็นของเราให้สูงขึ้นและขนานกับแนวเดิม",
    "funFacts": ["เรือดำน้ำใช้เปอริสโคปที่ยาวถึง 18 เมตร","กล้องเปอริสโคปถูกใช้ในสงครามโลกครั้งที่ 1 เพื่อมองข้ามคูหลบภัย"],
    "warnings": "ระวังคมของกระจกเมื่อติดตั้ง อย่าใช้มองดวงอาทิตย์โดยตรง",
    "image": "/assets/images/periscope.svg"
  },
  {
    "id": "lemon-battery",
    "title": "แบตเตอรี่มะนาว (Lemon Battery)",
    "category": "Chemistry",
    "difficulty": "Easy",
    "time": "15-30 นาที",
    "materials": ["มะนาว","เหรียญบาท (มีทองแดง)","ตะปูสังกะสี (หรือคลิปหนีบกระดาษชุบสังกะสี)","หลอดไฟ LED ขนาดเล็ก","สายไฟ"],
    "steps": [
      "คลึงมะนาวให้นิ่มเพื่อให้น้ำข้างในแตกตัว",
      "เสียบเหรียญบาทและตะปูลงในมะนาว โดยอย่าให้โลหะทั้งสองสัมผัสกัน",
      "ใช้สายไฟต่อขั้วบวก (เหรียญ) และขั้วลบ (ตะปู) เข้ากับขาของหลอด LED",
      "หากไฟไม่สว่างพอ ให้ทำแบตเตอรี่มะนาวเพิ่มอีก 2-3 ลูก แล้วนำมาต่อแบบอนุกรม (บวกต่อลบ)"
    ],
    "purpose": "สร้างกระแสไฟฟ้าจากผลไม้",
    "description": "สามารถทำให้หลอด LED สว่างขึ้นได้ เป็นการพิสูจน์หลักการพื้นฐานของแบตเตอรี่และเซลล์ไฟฟ้าเคมี",
    "sciencePrinciple": "น้ำมะนาวมีสภาพเป็นกรด ทำหน้าที่เป็นสารละลายอิเล็กโทรไลต์ (Electrolyte) เมื่อเราเสียบโลหะสองชนิดที่ต่างกัน (เช่น ทองแดงและสังกะสี) ลงไป กรดจะทำปฏิกิริยากับโลหะ ทำให้เกิดการแตกตัวของประจุและปล่อยอิเล็กตรอนออกมาจากขั้วหนึ่ง (สังกะสี) วิ่งไปยังอีกขั้วหนึ่ง (ทองแดง) เกิดเป็นกระแสไฟฟ้า",
    "funFacts": ["Alessandro Volta สร้างแบตเตอรี่ลูกแรกในปี 1800 ใช้หลักการเดียวกันนี้","มะเขือเทศและมันฝรั่งก็สามารถใช้ทำแบตเตอรี่ได้เช่นกัน"],
    "warnings": "ล้างมือหลังทำการทดลอง ระวังน้ำมะนาวเข้าตา",
    "image": "/assets/images/lemon-battery.svg"
  },
  {
    "id": "cartesian-diver",
    "title": "นักประดาน้ำคาร์ทีเซียน (Cartesian Diver)",
    "category": "Physics",
    "difficulty": "Easy",
    "time": "10-20 นาที",
    "materials": ["ขวดน้ำพลาสติกใส","หลอดหยดยา (Eye Dropper)","ดินน้ำมันเล็กน้อย (ถ้าจำเป็น)","น้ำ"],
    "steps": [
      "เติมน้ำให้เกือบเต็มขวดพลาสติก",
      "ดูดน้ำเข้าหลอดหยดเล็กน้อย ให้มันลอยปริ่มๆ ในแก้วน้ำ (ถ้ามันลอยมากไป ให้ติดดินน้ำมันเล็กน้อยเพื่อถ่วงน้ำหนัก)",
      "นำหลอดหยดใส่ลงในขวดแล้วปิดฝาให้แน่น",
      "ลองใช้มือบีบที่ข้างขวด นักประดาน้ำจะจมลง เมื่อปล่อยมือก็จะลอยขึ้น"
    ],
    "purpose": "สั่งให้วัตถุจมหรือลอยในขวดที่ปิดสนิทได้",
    "description": "ของเล่นวิทยาศาสตร์ที่น่าทึ่ง แสดงให้เห็นถึงพลังของความดันที่มองไม่เห็น เป็นการสาธิตหลักการความดันและการลอยตัวอย่างชัดเจน",
    "sciencePrinciple": "กฎของปาสคาลและหลักการของอาร์คิมิดีส - ปกติหลอดหยดจะลอยน้ำได้เพราะมีอากาศอยู่ข้างใน (มีความหนาแน่นรวมน้อยกว่าน้ำ) เมื่อเราบีบขวด ความดันจะถูกส่งผ่านน้ำเข้าไปในหลอดหยด ทำให้น้ำเข้าไปแทนที่อากาศ ปริมาตรอากาศลดลง ความหนาแน่นรวมของหลอดหยดจึงมากขึ้นจนหนักกว่าน้ำและจมลง",
    "funFacts": ["Descartes นักปรัชญาและนักคณิตศาสตร์ชาวฝรั่งเศสคิดค้นสิ่งนี้ในศตวรรษที่ 17","เรือดำน้ำใช้หลักการเดียวกันในการดำน้ำและลอยตัว"],
    "warnings": "ไม่มีอันตราย แต่ควรใช้ขวดพลาสติกที่บีบได้ง่าย",
    "image": "/assets/images/cartesian-diver.svg"
  },
  {
    "id": "camera-obscura",
    "title": "กล้องรูเข็ม (Camera Obscura)",
    "category": "Physics",
    "difficulty": "Easy",
    "time": "30-60 นาที",
    "materials": ["กล่องรองเท้า","กระดาษไข","กระดาษแข็งสีดำ","เข็ม","เทปดำ","คัตเตอร์"],
    "steps": [
      "เจาะรูสี่เหลี่ยมขนาดใหญ่ที่ฝากล่องด้านหนึ่ง",
      "นำกระดาษไขมาปิดรูนั้นเพื่อทำเป็นฉากรับภาพ",
      "ที่ฝากล่องอีกด้าน ให้เจาะรูสี่เหลี่ยมเล็กๆ แล้วนำกระดาษแข็งสีดำมาปิดทับ",
      "ใช้ปลายเข็มเจาะรูเล็กๆ ตรงกลางแผ่นกระดาษดำนั้น",
      "ปิดฝากล่องและใช้เทปดำซีลทุกรอยต่อไม่ให้แสงรั่ว",
      "หันด้านที่มีรูเข็มไปยังวัตถุที่มีแสงสว่าง แล้วมองภาพที่ปรากฏบนฉากกระดาษไข"
    ],
    "purpose": "ฉายภาพของโลกภายนอกเข้ามาในกล่องมืด",
    "description": "สามารถมองเห็นภาพสีของโลกภายนอกปรากฏขึ้นแบบหัวกลับ เป็นการเข้าใจหลักการทำงานพื้นฐานของกล้องถ่ายรูปและดวงตามนุษย์",
    "sciencePrinciple": "แสงเดินทางเป็นเส้นตรง เมื่อเราเจาะรูเล็กๆ บนกล่องมืด แสงจากวัตถุภายนอกจะเดินทางผ่านรูนั้นเข้ามาเพียงทิศทางเดียว แสงจากด้านบนของวัตถุจะเดินทางเป็นเส้นตรงลงมาที่ผนังด้านล่างของกล่อง และแสงจากด้านล่างของวัตถุจะเดินทางขึ้นไปที่ผนังด้านบน ทำให้เกิดเป็นภาพจริงหัวกลับ",
    "funFacts": ["Camera Obscura ถูกใช้โดยศิลปินในยุคเรเนซองส์เพื่อช่วยวาดภาพ","ภาพที่ได้จะชัดขึ้นถ้ารูเข็มเล็กกว่า แต่จะมืดกว่า"],
    "warnings": "อย่าใช้มองดวงอาทิตย์โดยตรง อาจทำลายดวงตาได้",
    "image": "/assets/images/camera-obscura.svg"
  },
  {
    "id": "hydraulic-arm",
    "title": "แขนกลไฮดรอลิก (Hydraulic Arm)",
    "category": "Engineering",
    "difficulty": "Medium",
    "time": "3-5 ชั่วโมง",
    "materials": ["กระดาษแข็งหรือไม้ไอติม","กระบอกฉีดยา (ไซริงค์) ขนาดต่างกัน 6-8 อัน","ท่อยางตู้ปลา","น็อตและสกรู","น้ำผสมสี"],
    "steps": [
      "สร้างโครงสร้างของแขนกลจากกระดาษแข็ง ประกอบด้วยฐาน แขนท่อนล่าง แขนท่อนบน และส่วนหัวหนีบ",
      "เชื่อมต่อข้อต่อแต่ละส่วนด้วยน็อตและสกรู",
      "ต่อไซริงค์เข้ากับข้อต่อต่างๆ เพื่อทำหน้าที่เป็นกล้ามเนื้อ",
      "ใช้ท่อยางตู้ปลาที่เติมน้ำสีไว้แล้ว เชื่อมต่อไซริงค์ที่แขนกลเข้ากับไซริงค์อีกชุดหนึ่งสำหรับควบคุม"
    ],
    "purpose": "สร้างแขนกลที่ขยับและยกของได้โดยไม่ใช้ไฟฟ้า",
    "description": "แขนกลที่สามารถควบคุมให้ขยับ หมุน และหนีบยกวัตถุน้ำหนักเบาได้ เป็นการเรียนรู้หลักการไฮดรอลิกที่ใช้ในรถขุด รถยก และเครื่องจักรหนักต่างๆ",
    "sciencePrinciple": "กฎของปาสคาล (Pascal's Principle) - เมื่อเราออกแรงกดที่กระบอกสูบอันหนึ่ง ความดันจะถูกส่งผ่านของเหลว (น้ำ) ไปยังกระบอกสูบอีกอันหนึ่งอย่างสม่ำเสมอ ทำให้เกิดแรงยกที่ปลายทาง เราสามารถใช้หลักการนี้ในการสร้างข้อต่อที่ขยับได้",
    "funFacts": ["ระบบไฮดรอลิกสามารถยกน้ำหนักได้มากกว่าระบบเกียร์ถึง 25 เท่า","เครื่องบินใช้ระบบไฮดรอลิกในการควบคุมท้องตีนครีด"],
    "warnings": "ระวังน้ำรั่วจากรอยต่อ อาจทำให้พื้นเปียก",
    "image": "/assets/images/hydraulic-arm.svg"
  },
  {
    "id": "weather-station",
    "title": "สถานีตรวจอากาศอนาล็อก (Analog Weather Station)",
    "category": "Engineering",
    "difficulty": "Medium",
    "time": "2-4 ชั่วโมง",
    "materials": ["ขวดพลาสติก","ลูกปิงปอง","หลอด","ไม้","ตะปู","แก้วทรงกระบอก","ปากกากันน้ำ"],
    "steps": [
      "สร้าง Anemometer: ตัดลูกปิงปองครึ่งซีกแล้วนำมาติดที่ปลายไม้ 4 อันที่ทำเป็นกากบาท ให้หันไปทางเดียวกันทั้งหมด แล้วนำไปติดบนแกนที่หมุนได้",
      "สร้าง Wind Vane: ตัดกระดาษแข็งเป็นรูปหัวลูกศรและหาง แล้วนำไปติดที่ปลายหลอดที่สมดุลบนแกนหมุน",
      "สร้าง Rain Gauge: นำแก้วทรงกระบอกมาติดสเกลวัดปริมาตร (มิลลิเมตร) ไว้ข้างๆ",
      "ประกอบทั้งสามส่วนเข้ากับฐานไม้เดียวกัน"
    ],
    "purpose": "สร้างชุดอุปกรณ์สำหรับวัดสภาพลมฟ้าอากาศเบื้องต้นโดยไม่ใช้อิเล็กทรอนิกส์",
    "description": "ชุดสถานีตรวจอากาศที่สามารถบอกทิศทางลม ความเร็วลมโดยประมาณ และปริมาณน้ำฝนได้ เหมาะสำหรับเรียนรู้หลักการอุตุนิยมวิทยาเบื้องต้น",
    "sciencePrinciple": "Anemometer ใช้หลักการต้านลม ถ้วยที่รับลมจะหมุนช้ากว่าด้านที่หันหลังให้ลม ทำให้เกิดการหมุน Wind Vane: ด้านหางที่มีพื้นที่มากกว่าจะถูกลมพัดแรงกว่า ทำให้หัวลูกศรชี้ไปยังทิศทางที่ลมพัดมา Rain Gauge: ใช้ภาชนะทรงกระบอกตรงเพื่อรวบรวมน้ำฝนและวัดปริมาตร",
    "funFacts": ["สถานีอากาศแห่งแรกของโลกถูกสร้างขึ้นในอิตาลีเมื่อปี 1654","Anemometer ถูกประดิษฐ์โดย Leon Battista Alberti ในปี 1450"],
    "warnings": "ติดตั้งในที่โล่งและมั่นคง ห่างจากต้นไม้และอาคารที่อาจบังลม",
    "image": "/assets/images/weather-station.svg"
  },
  {
    "id": "gravity-racer",
    "title": "รถแข่งพลังแรงโน้มถ่วง (Gravity Racer Go-Kart)",
    "category": "Engineering",
    "difficulty": "Hard",
    "time": "1-2 สัปดาห์",
    "materials": ["ไม้กระดาน","แผ่นไม้อัด","ล้อ (จากรถเข็นเด็กเก่าหรือซื้อใหม่)","สกรูและน็อต","เชือกสำหรับทำพวงมาลัย","เบรกไม้คาน"],
    "steps": [
      "สร้างโครงแชสซีหลักจากไม้กระดาน",
      "สร้างเพลาล้อหน้าและหลัง เพลาหน้าต้องสามารถเลี้ยวได้",
      "ติดตั้งระบบพวงมาลัยโดยใช้เชือกและรอก หรือใช้คานบังคับด้วยเท้า",
      "สร้างระบบเบรกอย่างง่าย โดยใช้ไม้คานที่ขัดกับพื้นหรือล้อ",
      "ติดตั้งที่นั่งและตรวจสอบความแข็งแรงของทุกชิ้นส่วน"
    ],
    "purpose": "สร้างยานพาหนะที่เคลื่อนที่ได้โดยอาศัยแค่พลังงานจากเนิน",
    "description": "รถโกคาร์ทที่สามารถขับเคลื่อนลงจากเนินได้จริง เป็นสุดยอดโปรเจกต์ที่ผสมผสานทั้งการออกแบบ งานไม้ และหลักการทางฟิสิกส์ เหมาะสำหรับการแข่งขันหรือเล่นสนุก",
    "sciencePrinciple": "การเปลี่ยนรูปพลังงานจากพลังงานศักย์โน้มถ่วง (Potential Energy) เมื่อรถอยู่บนที่สูง เปลี่ยนเป็นพลังงานจลน์ (Kinetic Energy) เมื่อรถเคลื่อนที่ลงมา การออกแบบให้มีแรงเสียดทานต่ำและโครงสร้างที่แข็งแรงคือหัวใจสำคัญ",
    "funFacts": ["การแข่งรถ Soap Box Derby เริ่มในอเมริกาตั้งแต่ปี 1933","รถ Gravity Racer ที่เร็วที่สุดสามารถวิ่งได้เร็วกว่า 120 km/h"],
    "warnings": "ต้องสวมหมวกกันน็อกและอุปกรณ์ป้องกันทุกครั้ง ทดสอบในพื้นที่ปลอดภัยเท่านั้น ตรวจสอบเบรกให้พร้อมใช้งาน ห้ามใช้บนถนนจริง",
    "image": "/assets/images/gravity-racer.svg"
  },
  {
    "id": "crystal-radio",
    "title": "วิทยุแร่ (Crystal Radio)",
    "category": "Physics",
    "difficulty": "Medium",
    "time": "2-3 ชั่วโมง",
    "materials": ["ลวดทองแดงอาบน้ำยา","แกนกระดาษทิชชู","ไดโอดเจอร์เมเนียม (1N34A) หรือแร่กาเลนา","หูฟังคริสตัล (ความต้านทานสูง)","สายไฟ","คลิปปากจระเข้"],
    "steps": [
      "พันขดลวดทองแดงรอบแกนกระดาษให้ได้ประมาณ 80-100 รอบ",
      "ขูดน้ำยาเคลือบที่ปลายลวดทั้งสองข้าง",
      "ต่อวงจรตามแผนผัง: เสาอากาศ -> ขดลวด -> ไดโอด -> หูฟัง -> สายดิน",
      "ต่อเสาอากาศ (ลวดยาวๆ) และสายดิน (ต่อกับท่อโลหะ)",
      "ใช้คลิปปากจระเข้ค่อยๆ แตะไล่ไปตามขดลวดเพื่อจูนหาคลื่นสถานี"
    ],
    "purpose": "ดักจับคลื่นวิทยุจากสถานี AM แล้วเปลี่ยนกลับเป็นเสียงโดยไม่ใช้แบตเตอรี่",
    "description": "ได้ยินเสียงจากสถานีวิทยุ AM ในหูฟังเบาๆ เป็นประสบการณ์ที่น่าทึ่งที่ได้ฟังเสียงจากอากาศเปล่าๆ โดยไม่ต้องใช้แบตเตอรี่หรือไฟฟ้า",
    "sciencePrinciple": "เสาอากาศและสายดินสร้างความต่างศักย์เพื่อรับคลื่นแม่เหล็กไฟฟ้าในอากาศ วงจรจูนเนอร์ (LC Circuit): ขดลวด (L) และตัวเก็บประจุ (C) ทำงานร่วมกันเพื่อเลือกรับความถี่ของสถานีที่ต้องการ ไดโอดทำหน้าที่กรองเอาเฉพาะสัญญาณเสียงออกจากคลื่นวิทยุ",
    "funFacts": ["วิทยุแร่ถูกใช้อย่างแพร่หลายในช่วงสงครามโลกครั้งที่ 2","สามารถรับฟังได้ไกลถึง 50 กิโลเมตรในเวลากลางคืน"],
    "warnings": "ต้องใช้หูฟังความต้านทานสูงเท่านั้น ห้ามใช้หูฟังทั่วไป เสาอากาศต้องไม่สัมผัสสายไฟฟ้า",
    "image": "/assets/images/crystal-radio.svg"
  },
  {
    "id": "cloud-chamber",
    "title": "ห้องเมฆ (Cloud Chamber)",
    "category": "Physics",
    "difficulty": "Hard",
    "time": "1-2 ชั่วโมง",
    "materials": ["ตู้ปลาหรือโหลแก้วใส","แผ่นโลหะสีดำ","น้ำแข็งแห้ง (Dry Ice)","แอลกอฮอล์ไอโซโพรพิล 99%","ฟองน้ำ","ไฟฉายแรงสูง","ถุงมือกันความเย็น"],
    "steps": [
      "ติดฟองน้ำไว้ที่ด้านในของฝาโหล",
      "นำแผ่นโลหะสีดำไปแช่ช่องฟรีซให้เย็นจัด",
      "เทแอลกอฮอล์ให้ชุ่มฟองน้ำ",
      "วางโหลแก้วคว่ำลงบนน้ำแข็งแห้ง",
      "ปิดฝาที่มีฟองน้ำชุ่มแอลกอฮอล์ลงบนโหล",
      "รอประมาณ 5-10 นาทีให้เกิดสภาวะไอยิ่งยวด",
      "เข้าไปในห้องมืด แล้วใช้ไฟฉายส่องผ่านด้านข้างของโหล"
    ],
    "purpose": "มองเห็นร่องรอยของอนุภาคที่มองไม่เห็นซึ่งเดินทางมาจากอวกาศ",
    "description": "จะมองเห็นเส้นหมอกเล็กๆ วิ่งไปมาอย่างรวดเร็วในโหล นั่นคือร่องรอยของอนุภาคจากอวกาศ เป็นการสังเกตการณ์ฟิสิกส์ยุคใหม่ที่น่าขนลุก",
    "sciencePrinciple": "สร้างสภาวะไอยิ่งยวด (Supersaturated Vapor) ของแอลกอฮอล์โดยทำให้ด้านล่างเย็นจัด (ด้วยน้ำแข็งแห้ง) และด้านบนอุ่น เมื่ออนุภาคพลังงานสูง (เช่น รังสีคอสมิก) วิ่งผ่านไอนี้ มันจะทิ้งร่องรอยการแตกตัวเป็นไอออนไว้ ไอนี้จะควบแน่นตามรอยนั้นทันที เกิดเป็นเส้นทางของหมอกให้เรามองเห็นได้",
    "funFacts": ["Cloud Chamber ถูกประดิษฐ์ในปี 1911 โดย Charles Thomson Rees Wilson","นักฟิสิกส์ใช้ Cloud Chamber ค้นพบโพซิตรอนในปี 1932"],
    "warnings": "น้ำแข็งแห้งเย็นมาก (-78°C) ห้ามสัมผัสด้วยมือเปล่า ใช้ในที่ระบายอากาศได้ดี แอลกอฮอล์ติดไฟง่าย ห่างจากเปลวไฟ",
    "image": "/assets/images/cloud-chamber.svg"
  },
  {
    "id": "aquaponics",
    "title": "ระบบเกษตรผสมผสาน (Aquaponics System)",
    "category": "Biology",
    "difficulty": "Medium",
    "time": "1-2 วัน (ตั้งระบบ)",
    "materials": ["ตู้ปลา","ปั๊มน้ำขนาดเล็ก","ท่อยาง","กระบะปลูกพืช","วัสดุปลูก (หินภูเขาไฟ ไฮโดรตรอน)","ปลา (ปลาหางนกยูง ปลาทอง)","พืช (ผักสลัด สมุนไพร)"],
    "steps": [
      "จัดตู้ปลาและเลี้ยงปลาตามปกติ",
      "วางกระบะปลูกพืชไว้เหนือตู้ปลา",
      "ติดตั้งปั๊มน้ำเพื่อปั๊มน้ำจากตู้ปลาขึ้นไปยังกระบะปลูก",
      "ออกแบบระบบให้น้ำไหลผ่านรากพืชแล้วล้นกลับลงตู้ปลา เป็นการเติมออกซิเจนไปในตัว",
      "ปลูกพืชในกระบะและเริ่มเดินระบบ"
    ],
    "purpose": "สร้างระบบนิเวศที่ปลาและพืชช่วยเหลือซึ่งกันและกัน",
    "description": "ระบบนิเวศขนาดเล็กที่สามารถผลิตได้ทั้งผักและปลา โดยแทบไม่ต้องให้ปุ๋ยหรือเปลี่ยนน้ำเลย เป็นระบบที่ยั่งยืนและเป็นมิตรกับสิ่งแวดล้อม",
    "sciencePrinciple": "วัฏจักรไนโตรเจน (Nitrogen Cycle) - ของเสียจากปลา (แอมโมเนีย) จะถูกแบคทีเรีย 2 ชนิดเปลี่ยนเป็นไนไตรต์ และสุดท้ายเป็นไนเตรต ซึ่งเป็นปุ๋ยชั้นดีสำหรับพืช พืชจะดูดซับไนเตรตไปใช้ในการเจริญเติบโต และทำให้น้ำสะอาดขึ้นก่อนจะไหลกลับไปให้ปลา เป็นระบบที่พึ่งพากันอย่างสมบูรณ์",
    "funFacts": ["ชาวแอซเท็กโบราณใช้ระบบคล้ายกันมากว่า 1,000 ปี","Aquaponics ใช้น้ำน้อยกว่าการปลูกพืชแบบดั้งเดิมถึง 90%"],
    "warnings": "ตรวจสอบคุณภาพน้ำเป็นประจำ อย่าให้ปลามากเกินไป เลือกพืชที่เหมาะสมกับระบบ",
    "image": "/assets/images/aquaponics.svg"
  },
  {
    "id": "wind-turbine",
    "title": "กังหันลมผลิตไฟฟ้า (Wind Turbine Generator)",
    "category": "Energy",
    "difficulty": "Hard",
    "time": "6-10 ชั่วโมง",
    "materials": ["ท่อ PVC (สำหรับทำใบพัด)","มอเตอร์ชนิดสเต็ปเปอร์ (Stepper Motor) จากปริ้นเตอร์เก่า","ไม้สำหรับทำโครงและหางเสือ","ไดโอดบริดจ์ (Bridge Rectifier)","วงจรชาร์จ USB","สายไฟ"],
    "steps": [
      "ตัดท่อ PVC ตามแบบเพื่อสร้างใบพัดที่มีประสิทธิภาพ",
      "สร้างดุมสำหรับยึดใบพัดเข้ากับแกนของสเต็ปเปอร์มอเตอร์",
      "สร้างโครงและหางเสือเพื่อให้กังหันหันหน้าสู้ลมเสมอ",
      "ต่อสายไฟจากมอเตอร์เข้ากับไดโอดบริดจ์เพื่อแปลงไฟฟ้ากระแสสลับเป็นกระแสตรง แล้วต่อไปยังวงจรชาร์จ USB",
      "นำไปติดตั้งในที่ที่มีลมแรง"
    ],
    "purpose": "ออกแบบและสร้างกังหันลมที่สามารถแปลงพลังงานลมให้เป็นพลังงานไฟฟ้า",
    "description": "กังหันลมที่สามารถผลิตไฟฟ้าเพียงพอสำหรับชาร์จโทรศัพท์มือถือหรือเปิดไฟ LED ได้ในวันที่มีลมแรง เป็นการเรียนรู้หลักการพลังงานหมุนเวียนและอากาศพลศาสตร์",
    "sciencePrinciple": "อากาศพลศาสตร์ (Aerodynamics): การออกแบบใบพัดให้มีลักษณะเหมือนปีกเครื่องบิน (Airfoil) เพื่อสร้างแรงยกและทำให้เกิดการหมุนเมื่อลมพัดผ่าน การเหนี่ยวนำแม่เหล็กไฟฟ้า: การหมุนของใบพัดจะไปหมุนแกนของเครื่องกำเนิดไฟฟ้า (Generator หรือ Stepper Motor) ทำให้เกิดการตัดกันของสนามแม่เหล็กและสร้างกระแสไฟฟ้าขึ้น",
    "funFacts": ["กังหันลมที่ใหญ่ที่สุดในโลกมีใบพัดยาวกว่า 100 เมตร","พลังงานลมสามารถผลิตไฟฟ้าได้มากกว่าพลังงานนิวเคลียร์ในหลายประเทศ"],
    "warnings": "ติดตั้งให้มั่นคงแข็งแรง ระวังใบพัดหมุนเร็ว อาจเป็นอันตราย ตรวจสอบวงจรไฟฟ้าก่อนใช้งาน",
    "image": "/assets/images/wind-turbine.svg"
  },
  {
    "id": "cnc-plotter",
    "title": "เครื่องวาดภาพ CNC (CNC Plotter)",
    "category": "Engineering",
    "difficulty": "Hard",
    "time": "1-2 สัปดาห์",
    "materials": ["ชุดขับเคลื่อนและสเต็ปเปอร์มอเตอร์จากไดรฟ์ CD/DVD เก่า 2 ตัว","บอร์ด Arduino","CNC Shield","ไดรเวอร์สเต็ปเปอร์มอเตอร์ (A4988)","เซอร์โวมอเตอร์ขนาดเล็ก","โครงสร้างจากแผ่นอะคริลิกหรือไม้"],
    "steps": [
      "ถอดชิ้นส่วนจากไดรฟ์ซีดีเพื่อเอาชุดมอเตอร์และรางเลื่อนออกมา",
      "ประกอบโครงสร้างให้มอเตอร์ตัวหนึ่งควบคุมแกน X และอีกตัวควบคุมแกน Y",
      "ติดตั้งเซอร์โวมอเตอร์สำหรับยกปากกาขึ้นลง (แกน Z)",
      "ต่อวงจรอิเล็กทรอนิกส์ Arduino CNC Shield และไดรเวอร์มอเตอร์เข้าด้วยกัน",
      "ติดตั้งเฟิร์มแวร์ (เช่น GRBL) ลงบน Arduino และใช้ซอฟต์แวร์บนคอมพิวเตอร์เพื่อส่งไฟล์ G-code ไปให้เครื่องวาด"
    ],
    "purpose": "รีไซเคิลขยะอิเล็กทรอนิกส์มาสร้างเป็นหุ่นยนต์วาดภาพ",
    "description": "หุ่นยนต์ที่สามารถวาดภาพเวกเตอร์หรือเขียนตัวอักษรได้อย่างแม่นยำ เป็นการเริ่มต้นสู่โลกของ Digital Fabrication และ Robotics",
    "sciencePrinciple": "การควบคุมเชิงตัวเลขด้วยคอมพิวเตอร์ (CNC - Computer Numerical Control) - ใช้ไมโครคอนโทรลเลอร์ (Arduino) ส่งสัญญาณไฟฟ้าไปควบคุมสเต็ปเปอร์มอเตอร์ให้เคลื่อนที่ไปในแกน X และ Y ได้อย่างแม่นยำตามพิกัดที่กำหนดในไฟล์ดิจิทัล (G-code)",
    "funFacts": ["เทคโนโลยี CNC ถูกพัฒนาครั้งแรกในช่วงทศวรรษ 1950 สำหรับอุตสาหกรรมการบิน","เครื่อง CNC สมัยใหม่สามารถแม่นยำถึง 0.001 มิลลิเมตร"],
    "warnings": "ต้องเข้าใจการเขียนโปรแกรมเบื้องต้น ระวังมอเตอร์ร้อน ตรวจสอบการต่อวงจรให้ถูกต้อง",
    "image": "/assets/images/cnc-plotter.svg"
  },
  {
    "id": "rube-goldberg",
    "title": "ความท้าทายรูบโกลด์เบิร์ก (The Rube Goldberg Challenge)",
    "category": "Engineering",
    "difficulty": "Hard",
    "time": "1-4 สัปดาห์",
    "materials": ["ทุกสิ่งทุกอย่าง! ของเล่นเก่า","หนังสือ","ลูกแก้ว","ท่อ","ราง","พัดลม","แม่เหล็ก","ไม้","เชือก","รอก","รถของเล่น"],
    "steps": [
      "กำหนดเป้าหมายสุดท้ายที่ง่ายที่สุด",
      "ออกแบบขั้นตอนแรกที่จะเริ่มต้นปฏิกิริยาลูกโซ่",
      "คิดและสร้างสถานีต่างๆ ที่จะเชื่อมต่อกัน โดยแต่ละสถานีจะทำงานเสร็จและไปกระตุ้นให้สถานีถัดไปทำงานต่อ",
      "ทดลองและแก้ไขปัญหาซ้ำแล้วซ้ำเล่า เพราะจุดที่ยากที่สุดคือการทำให้การส่งต่อพลังงานในแต่ละขั้นตอนแม่นยำและเชื่อถือได้"
    ],
    "purpose": "สร้างเครื่องจักรที่ทำงานซับซ้อนและมีปฏิกิริยาลูกโซ่หลายขั้นตอนที่สุด เพื่อทำงานง่ายๆ เพียงอย่างเดียว",
    "description": "การแสดงทางวิทยาศาสตร์ที่น่าตื่นตาตื่นใจและสนุกสนาน เป็นบทพิสูจน์สุดยอดของความคิดสร้างสรรค์และทักษะการแก้ปัญหาทางวิศวกรรม",
    "sciencePrinciple": "เป็นโปรเจกต์ปลายทางที่รวบรวมหลักการจากทุกพิมพ์เขียวมารวมกัน เช่น พลังงานศักย์ (ของที่กลิ้งลงมา) คานดีดคานงัด โมเมนตัม วงจรไฟฟ้า แรงดัน และอื่นๆ อีกมากมาย หัวใจสำคัญคือการถ่ายทอดพลังงาน (Energy Transfer) จากขั้นตอนหนึ่งไปยังอีกขั้นตอนหนึ่ง",
    "funFacts": ["Rube Goldberg เป็นนักการ์ตูนอเมริกันที่วาดเครื่องจักรซับซ้อนตลกๆ","สถิติโลกสำหรับ Rube Goldberg Machine ที่ซับซ้อนที่สุดมีมากกว่า 400 ขั้นตอน"],
    "warnings": "ระวังของหล่น การกระแทก และพลังงานที่สะสมไว้ ทดสอบทีละส่วนก่อนรวมเป็นระบบใหญ่",
    "image": "/assets/images/rube-goldberg.svg"
  }
]
